#### DistanceMeasuredFrom Enumeration

---

|  |
| --- |
| See Also |

Indicates if the distance is measured from the top or bottom of the wall.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public enum DistanceMeasuredFrom ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration DistanceMeasuredFrom ``` |

| Visual C++ |
| --- |
| ``` public enum class DistanceMeasuredFrom ``` |

# Members

| Member name | Description |
| --- | --- |
| Base | From bottom. |
| Top | From top. |

# See Also

Autodesk.Revit.DB Namespace